Revit 2024 API
LinkConversionData Properties
The LinkConversionData type exposes the following members.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Path
 The path to the source data used to generate the model.
ServerId
 The service responsible for converting the data into a Revit file.
See Also
LinkConversionData Class
Autodesk.Revit.DB Namespace